Revit 2026 API

# ComboBoxMember Class

---

This class represents an item in the drop-down list of a ComboBox.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIComboBoxMember

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxMember : RibbonItem
```
```vb
Public Class ComboBoxMember
	Inherits RibbonItem
```
```cpp
public ref class ComboBoxMember : public RibbonItem
```
```fsharp
type ComboBoxMember =
    class
        inherit RibbonItem
    end
```

The ComboBoxMember type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Enabled | Gets or sets a value indicating whether the item is enabled. (Inherited from RibbonItem) |
|  | GroupName | The group to which the ComboBoxMember is assigned. |
|  | Image | The image shown on the ComboBoxMember. |
|  | ItemText | Gets or sets the text displayed on the item. (Inherited from RibbonItem) |
|  | ItemType | Gets the item type.(Inherited from RibbonItem) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItem) |
|  | Name | The name of the item.(Inherited from RibbonItem) |
|  | ToolTip | The description that appears as a ToolTip for the item.(Inherited from RibbonItem) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItem) |
|  | Visible | Gets or sets a value indicating whether the item is visible. (Inherited from RibbonItem) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from RibbonItem) |
|  | GetContextualHelp | Gets the contextual help bound with this control.(Inherited from RibbonItem) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button.(Inherited from RibbonItem) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Note that a ComboBoxMember will not show an individual tool tip. Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace